interFoam/L474W45Q60GFillHmesh200/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
    volScalarFieldValue alpha.water 0
);

regions
(   
    boxToCell
    {
        box (-2 -0.395 0) (3 0.395 0.08);
        fieldValues
        (
            volVectorFieldValue U (0 0 0)
            volScalarFieldValue alpha.water 1
        );
    }
    /*
    boxToCell
    {
        box (-2 -0.395 0) (0 0.395 0.1);
        fieldValues
        (
            volVectorFieldValue U (0.1 0 0)
            volScalarFieldValue alpha.water 1
        );
    }
    boxToCell
    {
        box (0 -0.395 0) (3 0.395 0.09);
        fieldValues
        (
            volVectorFieldValue U (0.1 0 0)
            volScalarFieldValue alpha.water 1
        );
    }
    */
);


// ************************************************************************* //
